Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: Here is an example of using the as? operator to check for protocol conformance:
ja: as?演算子を使ってプロトコル準拠について調べる例がここにあります：

source: Here’s an example of how to handle an error when calling a method in Objective-C:
ja: ここにObejctive-Cにおいてメソッドを呼び出す時どのようにエラーを取り扱うかの例があります：

source: Here’s how Swift imports it:
ja: ここにスウィフトがそれをインポートする方法があります：

source: Here’s how Swift imports them as type members:
ja: ここにどのようにスウィフトがそれらを型メンバとしてインポートするかがあります：

source: Here’s how Swift imports them:
ja: ここにどのようにスウィフトがそれらをインポートするかがあります：

source: Here’s how it’s imported by Objective-C:
ja: ここにそれがObjective-Cによってインポートされる方法があります：

source: Here’s how they’re imported by Swift:
ja: ここに、どのようにそれらがスウィフトにインポートされるかがあります：

source: Here’s how to write a Swift type that represents a grocery product and can be used with any serialization format that provides encoders and decoders:
ja: ここにあるのは、日用製品を表して、エンコーダおよびデコーダで提供される何らかのシリアライズ形式で使用できるスウィフト型を書く方法です：

source: Here’s the corresponding Objective-C declaration in the generated header:
ja: ここに生成ヘッダにおける対応するObjective-C宣言があります：

source: Here’s the corresponding Swift type:
ja: ここに対応するスウィフト型があります：

source: Here’s the previous example, in Swift:
ja: ここにスウィフトでの以前の例があります：

source: However, because passing an optional when an Any was expected is uncommon, the optionals passed into the logSomeValue(_:) class method are explicitly cast to the Any type, which silences a compiler warning.
ja: しかしながら、Anyが期待された時オプショナルを渡すことは普通でないため、logSomeValue(_:)メソッドへと渡されるオプショナルは明示的にAny型へキャストされます、それはコンパイラ警告を黙らせます。

source: However, because the Any type can refer to any type, a downcast to a more specific type is not guaranteed to succeed.
ja: しかしながら、Any型はあらゆる型を参照できることから、より具体的な型へダウンキャウトすることは成功することを保証されません。

source: However, if a forced downcast fails, a runtime error is triggered:
ja: しかしながら、強制型キャストが失敗するならば、実行時エラーが引き起こされます：

source: However, if your product name has any nonalphanumeric characters, such as a period (.), they are replaced with an underscore (_) in your product module name.
ja: しかし、あなたの製品名がアルファベットでない文字、例えばピリオド（.）を持つならば、それらはあなたの製品モジュール名においてアンダーライン（_）と取り替えられます。

source: However, it is necessary when using APIs like key–value observing or the method_exchangeImplementations function in the Objective-C runtime, which dynamically replace the implementation of a method at runtime.
ja: しかしながら、それが必要であるのは、キー値監視またはmethod_exchangeImplementations関数のようなAPIをObjective-Cランタイムにおいて使う時です、それはあるメソッドの実装を実行時に動的に置き換えます。

source: However, macros can make debugging and refactoring difficult.
ja: しかし、マクロはデバッグやリファクタリングを難しくすることがあります。

source: However, there is an exception if the compilation condition includes a swift() platform condition: The statements are parsed only if the compiler’s version of Swift matches what is specified in the platform condition.
ja: しかしながら、例外があります、それはコンパイル条件がswift()プラットホーム条件を含む場合です：文はスウィフトのコンパイラのバージョンがプラットホーム条件において指定されるものと合致する場合にのみ構文解析されます。

source: However, there is no implicit conversion between these types and core Swift integer types, such as Int.
ja: しかし、これらの型と中心的なスウィフト整数型、例えばIntとの間に暗黙的な変換はありません。

source: However, these are imported by Swift as instance methods, as only Objective-C @property declarations are imported by Swift as properties.
ja: しかしながら、それらはスウィフトによってインスタンスメソッドのようにインポートされます、Objective-Cの@property宣言だけはスウィフトによってプロパティとしてインポートされます。

source: However, these properties must be computed; extensions can’t add stored properties to classes, structures, or enumerations.
ja: しかし、これらのプロパティは、計算されなければなりません；拡張は、保存プロパティをクラス、構造体、または列挙に加えることができません。

source: However, they are not accessible at compile time and do not appear in the generated header for a framework target.
ja: しかしながら、それらはコンパイル時にアクセス可能ではありません、そしてフレームワークターゲットのための生成ヘッダの中に現れません。

source: However, this does not prevent the Swift compiler from selecting a more efficient dispatch approach when those APIs are called from Swift code.
ja: しかしながら、これはスウィフトコンパイラがより効果的なディスパッチを選択することを、それらのAPIがスウィフトコードから呼び出される時に妨げはしません。

source: However, to avoid cyclical references, don’t import Swift code from within the same module into an Objective-C header (.h) file.
ja: しかしながら、循環参照を防ぐために、スウィフトコードを同じモジュール内部からObjective-Cヘッダ（.h）ファイルへとインポートしないでください。

source: However, you can also open an app programmatically and pass command-line arguments from Terminal.
ja: しかしながら、あなたはまたアプリをプログラムに基づきそしてコマンドライン引数を渡してTerminalから開くことができます。

source: However, you might not need to implement an initializer for types that are expected to or cannot be instantiated in this way.
ja: しかしながら、あなたはこの方法でインスタンス化されることが出来ないかそうするつもりでない型のためにイニシャライザを実装する必要はありません。

source: If 1 and 2 hold true, invoke the method and assign the result of the method to the value named fullScreenSize.
ja: １と２が当てはまるならば、そのメソッドを呼び出して、メソッドの結果をfullScreenSizeと名前をつけられる値に代入する。

source: If self maintains a strong reference to the block, such as a copying property, this would create a strong reference cycle.
ja: selfがブロックに対する強い参照を管理するならば、これは強い参照循環を作り出すでしょう。

source: If Objective-C code calls a Swift method that throws an error, the error is automatically propagated to the error pointer argument of the bridged Objective-C method.
ja: Objective-Cコードがエラーをスローするスウィフトメソッドを呼ぶならば、そのエラーは橋渡しされたObjective-Cメソッドのエラーポインタ引数に自動的に伝達されます。

source: If a Swift method does not specify a return type, the corresponding Objective-C method has a BOOL return type.
ja: そのスウィフトメソッドが戻り型を指定しないならば、対応するObjective-CメソッドはBOOLの戻り型を持ちます。

source: If a lazy property has not yet been initialized and is accessed by more than one thread at the same time, there is no guarantee that the property will be initialized only once.
ja: 遅延プロパティがまだ初期化されてしまわないのに１つ以上のスレッドによって同時にアクセスされるならば、そのプロパティがただ一度だけ初期化されるとは保証されません。

source: If all of the imported members have default values, Swift also provides a default initializer that takes no arguments.
ja: インポートされたメンバのすべてが省略時の値を持つならば、スウィフトもまた引数を取らない省略時のイニシャライザをひとつ提供します。

source: If an NSArray object does not specify a parameterized type, it is bridged to a Swift array of type [Any].
ja: NSArrayオブジェクトがパラメータ化された型を指定しないならば、それは型[Any]のスウィフト配列に橋渡しされます。

source: If an NSDictionary object does not specify parameterized types, it is bridged to a Swift dictionary of type [AnyHashable: Any].
ja: NSDictionaryオブジェクトがパラメーター化された型を指定しないならば、それは型[AnyHashable: Any]のスウィフト辞書に橋渡しされます。

source: If an NSSet object does not specify a parameterized type, it is bridged to a Swift set of type Set<AnyHashable>.
ja: NSSetオブジェクトがパラメーター化された型を指定しないならば、それは型Set<AnyHashable>のスウィフト集合に橋渡しされます。

source: If an NSDictionary or NSSet declaration does parameterize its key or object type, respectively, that type is used instead.
ja: あるNSDictionaryまたはNSSet宣言がそれのキーまたはオブジェクト型をパラメータ化するならば、それぞれ、その型が代わりに使われます。

source: If an Objective-C method is overridden by a Swift method that cannot be represented in Objective-C, such as by specifying a parameter to be a variable, that method must be marked @nonobjc.
ja: あるObjective-Cメソッドが、Objective-Cでは表現できないスウィフトメソッドによって、たとえばあるパラメータを変数であるとして指定することなどによって、オーバーライドされるならば、そのメソッドは@nonobjcと印されなければなりません。

source: If an Objective-C method throws an exception during runtime, Swift triggers a runtime error.
ja: Objective-Cメソッドが実行時に例外をスローするならば、スウィフトは実行時エラーの引き金を引きます。

source: If an error occurs in a Swift method, the error is thrown, and automatically propagated to the caller:
ja: エラーがスウィフトメソッドにおいて起こるならば、そのエラーはスローされます、そして自動的に呼び出し側に伝達されます：

source: If an error occurs in an Objective-C method, that error is used to populate the error pointer argument of that method:
ja: エラーがObjective-Cメソッドにおいて起こるならば、そのエラーはそのメソッドのエラーポインター引数に入れられるために使われます。

source: If an error producing Objective-C method returns a BOOL value to indicate the success or failure of a method call, Swift changes the return type of the function to Void.
ja: エラーを生成しているObjective-CメソッドがBOOL値を返してメソッド呼び出しが成功か失敗かを指し示すならば、スウィフトは関数の戻り型をVoidに変えます。

source: If another method is declared with the resulting selector, the method name is not changed.
ja: 結果として生じるセレクタで別のメソッドが宣言されるならば、メソッド名は変更されません。

source: If no nullability information is provided for a type, Swift cannot distinguish between optional and nonoptional references, and imports it as an implicitly unwrapped optional.
ja: ヌル許可情報がある型に提供されないならば、スウィフトはオプショナル参照と非オプショナル参照とを見分けることができません、そしてそれを暗黙的にアンラップされるオプショナルとしてインポートします。

source: If the Objective-C generic parameterization specifies a class qualification, the imported Swift class has a constraint that requires that type to be a subclass of the specified class.
ja: あるクラス資格をObjective-C総称体パラメータ化が指定するならば、インポートされたスウィフトクラスはある制約を持ちます、それは指定されたクラスのサブクラスであることをその型に要求します。

source: If the Objective-C generic parameterization specifies a protocol qualification, the imported Swift class has a constraint that requires that type to conform to the specified protocol.
ja: あるプロトコル資格をObjective-C総称体パラメータ化が指定するならば、インポートされたスウィフトクラスはある制約を持ちます、それは指定されたプロトコルに準拠することをその型に要求します。

source: If the Objective-C method’s error parameter is also its first parameter, Swift attempts to simplify the method name further, by removing the “WithError” or “AndReturnError” suffix, if present, from the first part of the selector.
ja: Objective-Cメソッドのエラーパラメーターがまたそれの最初のパラメーターでもあるならば、スウィフトは「WithError」または「AndReturnError」接尾辞を、もしあるならば、セレクタの最初の部分から取り除くことで、メソッド名をいっそう単純化することを試みます。

source: If the Swift compiler fails to identify a class factory method, you can use the NS_SWIFT_NAME macro, passing the Swift signature of the initializer to have it imported correctly.
ja: スウィフトコンパイラがクラスファクトリメソッドを識別するのを失敗したならば、あなたはNS_SWIFT_NAMEマクロを使うことができ、イニシャライザのスウィフトシグネチャを渡すことでそれは正しくインポートします。

source: If the Swift compiler mistakenly identifies a method as a class factory method, you can use the NS_SWIFT_NAME macro, passing the Swift signature of the method to have it imported correctly.
ja: スウィフトコンパイラが間違ってあるメソッドをクラスファクトリメソッドと識別するならば、あなたはNS_SWIFT_NAMEマクロを使うことができ、そのメソッドのスウィフトシグネチャを渡すことでそれは正しくインポートします。

source: If the Swift method has no parameters, AndReturnError: is appended to the Objective-C method name, otherwise error: is appended.
ja: そのスウィフトメソッドがパラメータを持たないならば、AndReturnError:がObjective-Cメソッド名に加えられ、そうでないならばerror:が加えられます。

source: If the Swift method returns a nonoptional type, the corresponding Objective-C method has an optional return type.
ja: そのスウィフトメソッドが非オプショナル型を返すならば、対応するObjective-Cメソッドはオプショナルの戻り型を持ちます。

source: If the app targets a version of iOS prior to 8.0 or macOS prior to 10.10, requestWhenInUseAuthorization() is unavailable, so the compiler reports an error.
ja: アプリがiOSの8.0より前のまたはmacOSの10.10より前のあるバージョンをターゲットにするならば、requestWhenInUseAuthorization()は利用可能でありません、それでコンパイラはエラーを報告します。

source: If the initializer takes an argument, the With is removed and the rest of the selector is divided up into named parameters accordingly.
ja: イニシャライザが引数をとるならば、Withは取り除かれて残りのセレクタが名前付きパラメーターへとそれらしく分離されます。

source: If the last non-block parameter of an Objective-C method is of type NSError **, Swift replaces it with the throws keyword, to indicate that the method can throw an error.
ja: Objective-Cメソッドの最後の非ブロックパラメーターが型NSError **ならば、スウィフトはそれをthrowsキーワードで置き換えて、そのメソッドがエラーをスローできることを示します。

source: If the method is called from Objective-C code, the error instead populates the error pointer argument.
ja: メソッドがObjective-Cコードから呼ばれるならば、代わりにエラーはエラーポインタ引数に入れられます。

source: If the method is called from Swift code, the error is propagated to its calling scope.
ja: メソッドがスウィフトコードから呼ばれるならば、エラーはそれを呼び出しているスコープに伝えられます。

source: If the method is unable to create an object with the regular file contents of the document, it throws an NSError object.
ja: メソッドがオブジェクトを書類の標準ファイル内容で作成することができないならば、それはNSErrorオブジェクトをスローします。

source: If the name begins with a number, the first number is replaced with an underscore.
ja: 名前が数で始まるならば、最初の数はアンダーラインと取り替えられます。

source: If the optional is nil, Swift bridges the nil value as an NSNull instance.
ja: そのオプショナルがnilならば、スウィフトはそのnil値をNSNullインスタンスとしてブリッジします。

source: If the protocol is defined in Swift, you can also add conformance to it to structures or enumerations, whether defined in Swift or Objective-C.
ja: そのプロトコルがスウィフトにおいて定義されるならば、スウィフトまたはObjective-Cで定義されるかに関係なく、あなたは同様にそれに対する準拠を構造体または列挙に加えることができます。

source: If the type of the value pointed to by a C pointer cannot be represented by Swift, such as an incomplete struct type, the pointer is imported as an OpaquePointer.
ja: Cポインタによって指し示される値の型がスウィフトによって表されることができないならば、たとえば不完全なstruct型など、そのポインタはOpaquePointerとしてインポートされます。

source: If you accept, Xcode creates the header file along with the file you were creating, and names it by your product module name followed by adding "-Bridging-Header.h".
ja: あなたが承諾するならば、Xcodeはヘッダ・ファイルをあなたがつくっていたファイルと一緒に作成して、あなたの製品モジュール名に続けて"-Bridging-Header.h"を加わることによってそれに名前をつけます。

source: If you are certain of the type of the object, you can use the forced downcast operator (as!) instead.
ja: あなたがそのオプジェクトの型について確信をもつならば、あなたは強制ダウンキャスト演算子（as!）を代わりに使うことができます。

source: If you do need to use a bridged Foundation object, you can cast between bridged types using the as type casting operator.
ja: あなたがブリッジFoundationオブジェクトを使うことをどうしても必要とするならば、あなたはブリッジ型の間でキャストすることがas型キャスト演算子を使って可能です。

source: If you have declared a function like this one:
ja: あなたがこのような関数を宣言したならば：

source: If you need to change the name imported by Swift of an Objective-C method, enumeration case, or option set value, you can use the NS_SWIFT_NAME macro to customize how a declaration is imported.
ja: あなたがObjective-Cメソッド、列挙ケース節、またはオプションセット値のスウィフトによってインポートされた名前を変更する必要があるならば、あなたはNS_SWIFT_NAMEマクロを使ってどのようにある宣言がインポートされるかをカスタマイズすることができます。

source: If you need to perform additional setup beyond initialization, you can assign the result of the invocation of a closure to the global constant:
ja: あなたが追加的な準備を初期化が済んだら実行する必要があるならば、あなたはあるクロージャの発動の結果をグローバル定数に割り当てることができます：

source: If you provide an Objective-C name for a Swift function, use Objective-C selector syntax.
ja: あなたがあるObjective-C名をスウィフト関数のために用意する場合は、Objective-Cセレクタ構文を使ってください。

source: If you return Core Foundation objects from your own C functions and Objective-C methods, you can annotate them with either the CF_RETURNS_RETAINED or CF_RETURNS_NOT_RETAINED macro to automatically insert memory management calls.
ja: あなたがコアファウンデーション・オブジェクトをあなた独自のC関数およびObjective-Cメソッドから返すならば、あなたはそれらにCF_RETURNS_RETAINEDまたはCF_RETURNS_NOT_RETAINEDマクロのどちらかで注釈をつけて、自動的にメモリ管理呼び出しを差し込むことができます。

source: If you use only annotated APIs that do not indirectly return Core Foundation objects, you can skip the rest of this section.
ja: あなたがコアファウンデーション・オブジェクトを間接的に返さない注釈をつけられたAPIだけを使うならば、あなたはこの節の残りをスキップすることができます。

source: If you use your own Objective-C types in your Swift code, make sure to import the Objective-C headers for those types before importing the Swift generated header into the Objective-C .m file you want to access the Swift code from.
ja: あなたがあなた独自のObjective-C型をあなたのスウィフトコードにおいて使うならば、必ずそれらの型のためのObjective-Cヘッダをインポートするようにするようにしてください、スウィフトの生成ヘッダをあなたがそれからスウィフトコードにアクセスすることを望むObjective-Cの.mファイルにインポートする前にです。

source: If you use your own Objective-C types in your Swift code, make sure to import the Objective-C headers for those types before importing the Swift generated header into the Objective-C .m file you want to use your Swift code from.
ja: あなたがあなたのスウィフトコードにおいてあなた独自のObjective-C型を使うならば、スウィフト生成のヘッダをあなたがそれからスウィフトコードにアクセスすることを望むObjective-C .mファイルにインポートする前に、必ずそれらの型のためのObjective-Cヘッダをインポートするようにするようにしてください。

source: If your app target is compiled with testing enabled, a unit test target can access any declaration with the internal modifier as if they were declared with the public modifier by prepending @testable to the product module import statement.
ja: あなたのアプリターゲットがテスト可能にされてコンパイルされるならば、ユニットテストターゲットはinternal修飾子を持つあらゆる宣言にアクセスできます、まるでそれらが、@testableを製品モジュールインポート文の先頭に付けることで、public修飾子とともに宣言をされたかのようにです。

source: If you’re calling a method with no arguments, you must still include parentheses.
ja: あなたが引数なしでメソッドを呼んでいる場合、あなたはそれでも括弧を含めなければなりません。

source: If you’re working with frameworks, make sure the Defines Module (DEFINES_MODULE) build setting under Packaging is set to “Yes”.
ja: あなたがフレームワークを扱ってならば、「Packaging」の下の「Defines Module（DEFINES_MODULE）」ビルド設定が「Yes」に設定されることを確認してください。

source: If you’re working with the Objective-C bridging header, make sure the Objective-C Bridging Header (SWIFT_OBJC_BRIDGING_HEADER) build setting under Swift Compiler - Code Generation is set to a path to the bridging header file relative to your project (for example, “MyApp/MyApp-Bridging-Header.h”).
ja: あなたがObjective-C橋渡しヘッダを扱っているならば、「Swift Compiler - Code Generation」下の「Objective-C Bridging Header（SWIFT_OBJC_BRIDGING_HEADER）」ビルド設定が、あなたのプロジェクトに関連する橋渡しヘッダファイルへのパスを持つことを確認してください（例えば、「MyApp/MyApp-Bridging-Header.h」）。

source: If you’re writing a mixed-language app, you may need to access your Objective-C code from Swift and your Swift code from Objective-C.
ja: あなたが混合言語のアプリを書いているならば、あなたは、あなたのObjective-Cコードにスウィフトから、そしてあなたのスウィフトコードにObjective-Cからアクセスする必要があるかもしれません。

source: If you’re writing a mixed-language framework, you may need to access your Objective-C code from Swift and your Swift code from Objective-C.
ja: あなたが混合言語のフレームワークを書いているならば、あなたはObjective-Cコードにあなたのスウィフトから、そしてあなたのスウィフトコードにObjective-Cからアクセスする必要があるかもしれません。

source: Implementing Core Data Managed Object Subclasses
ja: コアデータ管理オブジェクトのサブクラスを実装する

source: Import into Objective-C
ja: Objective-Cへインポートする

source: Import into Swift
ja: スウィフトへインポートする

source: Import relevant system frameworks.
ja: 関連するシステム・フレームワークをインポートしてください。

source: Import the Swift code from that framework target into any Objective-C .m file within that framework target using this syntax and substituting the appropriate names:
ja: スウィフトコードをそのフレームワークターゲットから、そのフレームワークターゲット内の何らかのObjective-C .mファイルにこの構文を使って、適切な名前で置き換えて、インポートしてください：

source: Import the Swift code from that target into any Objective-C .m file within that target using this syntax and substituting the appropriate name:
ja: そのターゲットからスウィフトコードを何らかのObjective-Cの.mファイルへ、この構文を使って、適切な名前で置き換えて、インポートしてください：

source: Imported Constant Enumerations and Structures
ja: インポートされる定数列挙と構造体

source: Imported Foundation classes and protocols drop their NS prefix, with the following exceptions:
ja: インポートされたFoundationのクラスおよびプロトコルは、それらのNS接頭辞を外します、以下の例外を除いては：

source: Importing Code from Within the Same App Target
ja: コードを同じアプリターゲットからインポートする

source: Importing Code from Within the Same Framework Target
ja: コードを同じフレームワークターゲット内からインポートする

source: Importing External Frameworks
ja: 外部のフレームワークをインポートする

source: Importing Functions as Type Members
ja: 関数を型メンバとしてインポートする

source: Importing Objective-C into Swift
ja: Objective-Cをスウィフトにインポートする

source: Importing Swift into Objective-C
ja: スウィフトをObjective-Cにインポートする

source: In Build Settings, in Swift Compiler - Code Generation, make sure the Objective-C Bridging Header build setting has a path to the bridging header file.
ja: Build Settingsにおいて、Swift Compiler - Code Generationにおいて、Objective-C Bridging Headerビルド設定がブリッジしているヘッダファイルへのパスを持つことを確実にしてください。

source: In C, the pthread_once() function in POSIX and the dispatch_once() and dispatch_once_f() functions in Grand Central Dispatch provide mechanisms for executing initialization code exactly once.
ja: Cでは、POSIXでのpthread_once()関数およびGrand Central Dispatchでのdispatch_once()とdispatch_once_f()関数は、厳密に一度だけ初期化コードを実行する仕組みを提供します。

source: In C, the sizeof and alignof operators return the size and alignment of any variable or data type, In Swift, you use MemoryLayout<T> to access the memory layout of the parameterized type T through the size, stride, and alignment properties.
ja: Cでは、sizeofおよびalignof演算子はあらゆる変数またはデータ型のサイズとアラインメントを返します、スウィフトでは、あなたはMemoryLayout<T>を使って、パラメータ化された型Tのメモリレイアウトにsize、stride、そしてalignmentプロパティを通してアクセスします。

source: In Cocoa, methods that produce errors take an NSError pointer parameter as their last parameter, which populates its argument with an NSError object if an error occurs.
ja: Cocoaでは、エラーを生成するメソッドは、それの最後のパラメーターとしてNSErrorポインターパラメーターを取ります、エラーが起こるならばその引数にNSErrorオブジェクトが入ります。

source: In Cocoa, you register operations with NSUndoManager to allow users to reverse that operation’s effect.
ja: Cocoaでは、あなたはそれぞれの操作をNSUndoManagerに登録して、ユーザがその操作の効果を取り消せるようにします。

source: In Objective-C, a key is a string that identifies a specific property of an object.
ja: Objective-Cでは、keyはオプジェクトの特定のプロパティを識別するある文字列です。

source: In Objective-C, a pointer type declaration can use the _Nullable and _Nonnull annotations to specify whether or not that pointer may have a nil or NULL value.
ja: Objective-Cでは、ボインタ型宣言は_Nullableおよび_Nonnull注釈を使うことで、そのポインタがnilまたはNULL値を持つかどうか指定できます。

source: In Objective-C, a property may override its synthesized getter method such that the underlying instance variable is conditionally initialized if its value is nil:
ja: Objective-Cでは、プロパティは、それの合成されたゲッターメソッドをオーバーライドできます、例えば、裏に潜んだインスタンス変数が、それの値がnilかどうかで、条件付きで初期化されるように：

source: In Objective-C, a selector is a type that refers to the name of an Objective-C method.
ja: Ojbective-Cでは、セレクタはObjective-Cメソッドの名前を参照するある型です。

source: In Objective-C, an option set is a bit mask of integer values.
ja: Objective-Cでは、オプションセットは整数値のビットマスクです。

source: In Objective-C, autorelease pool blocks are marked using @autoreleasepool.
ja: Objective-Cでは、オートリリース・ブロックは@autoreleasepoolを使って印されます。

source: In Objective-C, constants are often used to provide a list of possible values for properties and method parameters.
ja: Objective-Cでは、プロパティおよびメソッドパラメータに対する候補の値のリストを提供するためにしばしば定数が使われます。

source: In Objective-C, error handling is opt-in, meaning that errors produced by calling a method are ignored unless an error pointer is provided.
ja: Objective-Cでは、エラー処理はオプトインです、それはメソッドを呼び出すことで生成されたエラーはエラーポインターが提供されない限りは無視されるということを意味しています。

source: In Objective-C, error handling is opt-in, meaning that errors produced by calling a method are ignored unless you provide an error pointer.
ja: Objective-Cでは、エラー処理はオプトインです、それはメソッドを呼び出すことで生成されたエラーはあなたがエラーポインターを提供しない限りは無視されるということを意味しています。

source: In Objective-C, if you need to capture self in a block, it’s important to consider the memory management implications.
ja: Objective-Cにおいて、あなたがselfをあるブロックにおいてキャプチャする必要があるならば、メモリ管理の影響を考慮することが重要です。

source: In Objective-C, initializers directly return the object they initialize.
ja: Objective-Cでは、イニシャライザは直接にそれが初期化したオブジェクトを返します。

source: In Objective-C, properties have a range of potential attributes that specify additional information about a property’s behavior.
ja: Objective-Cにおいて、プロパティたちは、あるプロパティの挙動に関する追加の情報を指定する多種多様な潜在的な属性を持ちます。

source: In Objective-C, the success or failure of the method can be determined by whether an NSURL object is returned.
ja: Objective-Cでは、メソッドの成功や失敗は、NSURLオブジェクトが返されるかどうかによって判断されることができます。

source: In Objective-C, this method’s last parameter is of type NSError **.
ja: Objective-Cでは、このメソッドの最後のパラメーターは型NSError **です。

source: In Objective-C, you can ensure that only one instance of a singleton object is created by wrapping its initialization in a call the dispatch_once function, which executes a block once and only once for the lifetime of an app:
ja: Objective-Cでは、あなたはあるシングルトンオブジェクトにただ１つのインスタンスが作成されることを、それの初期化を、あるプロックをあるアプリのライフタイムに対していっぺんこっきり実行するdispatch_once関数呼び出しの中にラップする（包む）ことによって確実にできます：

source: In Objective-C, you can use the Foundation framework classes NSJSONSerialization and NSPropertyListSerialization to initialize objects from a decoded JSON or property list serialization value—usually an object of type NSDictionary<NSString *, id>.
ja: Objective-Cでは、あなたはFoundationフレームワーククラスのNSJSONSerializationとNSPropertyListSerializationを使って、復号化されたJSONまたはプロパティリストのシリアライズ値 ― 通常は型NSDictionary<NSString *, id>のオブジェクトから各オブジェクトを初期化します。

source: In Objective-C, you do this:
ja: Objective-Cでは、あなたはこうします：

source: In Objective-C, you pass NULL for the error parameter when you only care whether there was an error, not what specific error occurred.
ja: Objective-Cでは、あなたはNULLをエラーパラメータのために渡すことが、あなたが心配するのがただエラーがあったかどうかだけであり、特定のエラーに出くわしたことではない時に行えます。
